src_ext/InformationRegisters/УЗ_Оповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Оповещения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_СписаниеОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасходДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_НачисленияПедагогам</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПриходДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ГрафикРабочегоВремениПедагога</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_НачислениеБонусов</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПеремещениеДенег</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасчетЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/CommonModules/УЗ_ОповещенияКлиент/Ext/Module.bsl
//Оповещения и напоминания «Учёта занятий» на клиенте (замена напоминаний пользователя БСП:
//свой регистр УЗ_Оповещения, показ по таймеру из модуля приложения, команда «Напомнить»).

//Показать оповещения всплывающими окнами. Больше трёх — одно окно со ссылкой на список,
//чтобы не засыпать экран (например, утром после проверки задолженности).
Процедура Показать(Оповещения) Экспорт

	Если Оповещения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если Оповещения.Количество() > 3 Тогда
		ПоказатьОповещениеПользователя(
			СтрШаблон(НСтр("ru = 'Оповещений: %1'"), Оповещения.Количество()),
			"e1cib/list/РегистрСведений.УЗ_Оповещения",
			НСтр("ru = 'Откройте список оповещений'"),
			БиблиотекаКартинок.ДиалогИнформация, СтатусОповещенияПользователя.Важное);
		Возврат;
	КонецЕсли;
	Для Каждого Оповещение Из Оповещения Цикл
		ПоказатьОповещениеПользователя(Оповещение.Описание, Оповещение.Ссылка, Строка(Оповещение.Источник),
			БиблиотекаКартинок.ДиалогИнформация, СтатусОповещенияПользователя.Важное);
	КонецЦикла;

КонецПроцедуры

//Команда «Напомнить»: форма новой записи оповещения по объекту (время, текст, пользователь —
//текущий). Форма открывается обычным окном, не модально.
Процедура Напомнить(Источник, Владелец = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Источник) Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Напомнить'"), ,
			НСтр("ru = 'Сначала запишите объект.'"), БиблиотекаКартинок.ДиалогВосклицание);
		Возврат;
	КонецЕсли;
	ЗначенияЗаполнения = УЗ_Сервер.ЗначенияНапоминания(Источник);
	ОткрытьФорму("РегистрСведений.УЗ_Оповещения.ФормаЗаписи",
		Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), Владелец);

КонецПроцедуры
